brew "bash"
brew "bash-completion"
brew "bash-completion@2", conflicts_with: ["bash-completion"]
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "duti"
brew "git"
brew "git-number"
brew "gnupg"
brew "jenv"
brew "jq"
brew "mas"
brew "node"
brew "nvm"
brew "openssl"
brew "p7zip"
brew "pinentry-mac"
brew "pyenv"
brew "rbenv"
brew "vim"
brew "whalebrew"
brew "yarn"

tap "homebrew/cask"
tap "adoptopenjdk/openjdk"
cask_args appdir: "/Applications"

cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "alfred"
cask "cheatsheet"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "maccy"
cask "postman"
cask "rectangle"
cask "sublime-text"
cask "visual-studio-code"
