# formulae

brew "awscli"
brew "bash-completion"
brew "bash-completion@2", link: true, conflicts_with: ["bash-completion"]
brew "bash"
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "duti"
brew "git-delta"
brew "git-number"
brew "git"
brew "gnupg"
brew "jenv"
brew "jq"
brew "less", link: true
brew "mas"
brew "node"
brew "nvm"
brew "openssl"
brew "php"
brew "pinentry-mac"
brew "pyenv"
brew "rbenv"
brew "vim"
brew "websocat"
brew "whalebrew"
brew "yarn"


# applications
cask_args appdir: "/Applications"

cask "1password"
cask "alfred"
cask "apparency"
cask "cheatsheet"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "maccy"
cask "phpstorm"
cask "postman"
cask "rectangle"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webstorm"

# quicklook plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"


# mac app store apps
mas "Amphetamine", id: 937984704
mas "Sip", id: 507257563
mas "Unclutter", id: 577085396
mas "Xcode", id: 497799835